'use strict'

// -----------------------------------------УСЛОВИЯ-----------------------------------------

// -----------------------------------------Задание 1-----------------------------------------

// const a = +prompt('Введите катет A');
// const b = +prompt('Введите катет B');
// const c = +prompt('Введите гипотенузу');

// if ((c**2) === ((a**2) + (b**2))) {
// 	alert('Это прямоугольный треугольник');
// } else {
// 	alert('Этот треугольник не прямоугольный');
// };

// -----------------------------------------Задание 2-----------------------------------------

// const a = +prompt('Введите первое число');
// const b = +prompt('Введите второе число');
// const c = +prompt('Введите третье число');

// МОЙ ВАРИАНТ

// if (a - b > 0) {
// 	if (a - c > 0) {
// 		alert(`Число ${a} максимальное`)
// 	}
// } else if (b - a > 0) {
// 	if (b - c > 0) {
// 		alert(`Число ${b} максимальное`)
// 	}
// } else if (c - a > 0) {
// 	if (c - b > 0) {
// 		alert(`Число ${c} максимальное`)
// 	}
// }

// С ОТВЕТА ВАРИАНТ

// const a = +prompt('Введите первое число');
// const b = +prompt('Введите второе число');
// const c = +prompt('Введите третье число');

// if (a > b) {
// 	if (a > c) {
// 		alert(a);
// 	} else {
// 		alert(c);
// 	}
// } else if (b > c) {
// 	alert(b);
// } else {
// 	alert(c);
// }

// --------------------------------------------------Задание 3---------------------------------------------------

// const num = +prompt('Введите число');

// if (!isNaN(num)) {
// 	if (num % 2 === 0) {
// 		alert(`${num} чётное число`);
// 	} else {
// 		alert(`${num} нечётное число`);
// 	}
// } else {
// 	alert('Вы ввели не число');
// }
