// ======================================Задание 1=========================================

// В переменную password запишите строку с любым произвольным паролем. Проверьте надёжность пароля. Пароль является надёжным, когда в нём есть хотя бы четыре символа, а также есть хотя бы один из символов '-', '_'. Выведите в консоль сообщения «Пароль надёжный» или «Пароль недостаточно надёжный».

// let password = prompt('Введите пароль');

// if (password.length >= 4 && (password.includes('-') || password.includes('_'))) {
// 	console.log('Пароль надёжный');
// } else {
// 	console.log('Пароль недостаточно надёжный');
// }

// =====================================Задание 2============================================

// В переменных name, surname написаны имя и фамилия человека. При этом в строках беспорядок с большими и маленькими буквами, и нужно привести строки в порядок. Для этого первые буквы имени и фамилии приведите к верхнему регистру, а оставшиеся буквы — к нижнему. Запишите результат в новые переменные и выведите их значения с помощью console.log. С помощью тернарных операторов и console.log выведите сообщение «Имя было преобразовано» или «Имя осталось без изменений» для имени и фамилии в зависимости от того, были ли исходные строки равны преобразованным.

// let firstName = 'ОлЕГ';
// let surname = 'оЛеГсЕЕВ';

// let editedName = firstName.slice(0, 1).toUpperCase() + firstName.slice(1, firstName.length).toLowerCase();
// let editedSurname = surname.slice(0, 1).toUpperCase() + surname.slice(1, surname.length).toLowerCase();

// console.log(editedName);
// console.log(editedSurname);

// console.log(firstName === editedName ? 'Имя осталось без изменений' : 'Имя было преобразовано');
// console.log(surname === editedSurname ? 'Фамилия осталась без изменений' : 'Фамилия была преобразована');