// =========================================Задание 1==========================================================

// Напишите генератор массивов длиной count со случайными числами от n до m. Учтите, что n и m могут быть отрицательными, а также может быть n > m или n < m. Выведите результат с помощью console.log.

// let n = 0;
// let m = 10;
// let count = 70;

// let max = Math.max(m, n);
// let min = Math.min(m, n);
// let precision = Math.abs(max - min);

// let array = [];

// for (let i = 1; i <= count; i++) {
// 	array.push(Math.round(Math.random() * precision) + min);
// }

// console.log(max);
// console.log(min);
// console.log(array);
// console.log(array.length);

// ===========================================Задание 2==========================================================

// С помощью цикла создать перевёрнутый вариант произвольной строки. Например, строка «Привет, мир!» должна превратиться в «!рим ,тевирП».

// let str = 'Привет, мир!';

// let reversedStr = '';

// for (let i = str.length - 1; i >= 0; i--) {
// 	reversedStr += str[i];
// }
// console.log(reversedStr);

// ===========================================Задание 3================================================================

// Танк едет по дороге, на которой могут быть противотанковые мины. Дорога должна быть представлена в виде массива roadMines из 10 boolean-элементов. Если элемент равен true, то это мина. Движение танка должно быть представлено как цикл, в котором одна итерация — продвижение танка на следующий участок дороги (следующий элемент массива). При передвижении выводить в консоль сообщение «танк переместился на ${position}», где position — номер ячейки + 1. Если танк попал на мину, то нужно вывести сообщение «танк повреждён», если это 1-й взрыв, и «танк уничтожен», если это 2-й взрыв. После 2-го взрыва танк считается уничтоженным и прекращает движение.

// let roadMines = [false, false, false, false, false, false, false, false, false, false];
// let tankPosition = 0;
// let explosionCount = 0;

// for (let i = 0; i <= roadMines.length - 1; i++) {
// 	if (roadMines[i] === false && explosionCount !== 2) {
// 		tankPosition++;
// 		console.log(`Танк переместился на позицию ${tankPosition}`);
// 	} else if (roadMines[i] === true && explosionCount < 1) {
// 		tankPosition++;
// 		console.log(`Танк переместился на позицию ${tankPosition}`);
// 		console.log(`Танк повреждён на позиции ${tankPosition}`);
// 		explosionCount++;
// 	} else {
// 		console.log(`Танк переместился на ${tankPosition + 1}`);
// 		console.log(`Танк уничтожен на позиции ${tankPosition + 1}`);
// 		break;
// 	}
// }

// =========================================Задание 4=============================================

// Сгенерировать массив чисел 1–31 включительно (числа месяца). Вывести с помощью console.log для каждого из чисел строку ${число} января, ${день недели}. День недели 1 января должен задаваться с помощью переменной, то есть программа должна корректно работать для любого дня недели, с которого начинается месяц. Подсказка 1: для дней недели можно создать массив с названиями дней, чтобы обращаться к нему по индексу. Подсказка 2: индекс дня недели можно вычислить с помощью операции остатка от деления.

// let monthArray = [];
// let weekArray = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье',];

// let monthDay = 3; // Четверг

// for (let i = 1; i <= 31; i++) {
// 	monthArray.push(i);
// }

// for (let i = 0; i < monthArray.length; i++) {
// 	console.log(`${monthArray[i]} января - это ${weekArray[(i + monthDay) % 7]}`);
// }